app/controllers/contact_controller.rb

INSERT INTO `contacts` (`nombre`, `apellidos`, `calle`, `poblacion`, `provincia`, `pais`, `created_at`, `updated_at`) VALUES ('alejandro gregori tomas', 'tomas', 'avenica iecla 1 esc2 4ºb pta18', 'benicarló', 'Valenciana, Comunidad', 'España', '2019-11-23 19:38:58.528105', '2019-11-23 19:38:58.528105')
---
  def create
    @contact = Contact.new(contact_params)
    @contact.save

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contact = Contact.all

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 12 LIMIT 1
---
  def show
    @contact = Contact.find(params[:id])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 17 LIMIT 1
---
  def edit
     @contact = Contact.find(params[:id])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 17 LIMIT 1
UPDATE `contacts` SET `contacts`.`calle` = 'Albercas', `contacts`.`poblacion` = 'Fornite ', `contacts`.`updated_at` = '2019-11-24 18:22:39.416444' WHERE `contacts`.`id` = 58
---
  def update
    @contact = Contact.find(params[:id])
    @contact.update_attributes(contact_params)

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 28 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 28
---
  def delete
    @contact = Contact.find(params[:id])
    #si comentamos lineas de abajo salta delete.html.erb
    @contact.destroy

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 1
---
  def destroy
    @contact = Contact.find(params[:id])
   # @contact.destroy(contact_params)
   # @contact = Task.find(params[:id])
   # @phone = Action.where(contact_id: @contact)
   # @phone.each do |t|
   #   t.destroy
   # @email = Action.where(contact_id: @contact)
   # @email.each do |t|
   #   t.destroy
   #
    @contact.destroy